<a href="https://colab.research.google.com/github/vitor-edu/Programa-de-Formacao-Big-Data-BRQ/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Biblioteca Pandas

In [2]:
import pandas as pd  # Importar o pacote pandas. 
from google.colab import files

uploaded = files.upload()

Saving teste_1.xlsx to teste_1.xlsx

In [3]:
files.download("teste_1.xlsx") # Dowloader do arquivo na minha máquina.

In [4]:
dados1 = pd.read_excel('teste_1.xlsx') # A Função read lê o arquivo excel. 
dados1

   numeros letras
0        1      a
1        2      b
2        3      c
3        4      d
4        5      e
5        6      f
6        7      g
7        8      h
8        9      i
9       10      j

In [5]:
dados1.shape # Visualizar linhas e colunas através dio comando shape.

(10, 2)

In [6]:
dados1.head(10) # Comando head retorna a quantidade de linha estipulada como parâmetro.

   numeros letras
0        1      a
1        2      b
2        3      c
3        4      d
4        5      e
5        6      f
6        7      g
7        8      h
8        9      i
9       10      j

In [7]:
uploaded = files.upload() # Fazendo upload da base de dados census.

Saving census.csv to census.csv

In [8]:
dados_2 =  pd.read_csv("census.csv") # Visualizando 
dados_2

       Unnamed: 0  age  ...  native.country  income
0               1   39  ...   United-States   <=50K
1               2   50  ...   United-States   <=50K
2               3   38  ...   United-States   <=50K
3               4   53  ...   United-States   <=50K
4               5   28  ...            Cuba   <=50K
...           ...  ...  ...             ...     ...
30157       32557   27  ...   United-States   <=50K
30158       32558   40  ...   United-States    >50K
30159       32559   58  ...   United-States   <=50K
30160       32560   22  ...   United-States   <=50K
30161       32561   52  ...   United-States    >50K

[30162 rows x 16 columns]

In [9]:
dados_2.shape # Mostra a quantidade de linhas e colunas.

(30162, 16)

In [10]:
type(dados_2)

pandas.core.frame.DataFrame

In [11]:
dados_2.head(5) # Retornando 5 linhas do dataframe.

   Unnamed: 0  age          workclass  ...  hour.per.week  native.country  income
0           1   39          State-gov  ...             40   United-States   <=50K
1           2   50   Self-emp-not-inc  ...             13   United-States   <=50K
2           3   38            Private  ...             40   United-States   <=50K
3           4   53            Private  ...             40   United-States   <=50K
4           5   28            Private  ...             40            Cuba   <=50K

[5 rows x 16 columns]

In [12]:
alunos = {'nome': ['Marcelo','Lucas','Cynthia','Helena'], 'Media':[4,7,5.5,9],
          'Status':['Reprovado','Aprovado','Reprovado','Aprovado']}

In [13]:
type(alunos) # Tipo de dados.

dict

In [14]:
data_frame1 = pd.DataFrame(alunos) # Transformar um dicionário em um dataframe. 
type(data_frame1)
data_frame1

      nome  Media     Status
0  Marcelo    4.0  Reprovado
1    Lucas    7.0   Aprovado
2  Cynthia    5.5  Reprovado
3   Helena    9.0   Aprovado

In [15]:
data_frame1.shape # Retornas quantidade de linhas e colunas.

(4, 3)

In [16]:
data_frame1.head(2)

      nome  Media     Status
0  Marcelo    4.0  Reprovado
1    Lucas    7.0   Aprovado

In [24]:
data_frame1.describe() # Comando describe retorna alguns valores estatísticos do dataframe.

          Media
count  4.000000
mean   6.375000
std    2.136001
min    4.000000
25%    5.125000
50%    6.250000
75%    7.500000
max    9.000000

In [19]:
data_frame1['Status'] # Retornando a coluna passada como parâmetro.

0    Reprovado
1     Aprovado
2    Reprovado
3     Aprovado
Name: Status, dtype: object

In [24]:
data_frame1

      nome  Media     Status
0  Marcelo    4.0  Reprovado
1    Lucas    7.0   Aprovado
2  Cynthia    5.5  Reprovado
3   Helena    9.0   Aprovado

In [33]:
data_frame1.loc[:3] # Retornando a linha de posição zero até a posição 3.

      nome  Media     Status
0  Marcelo    4.0  Reprovado
1    Lucas    7.0   Aprovado
2  Cynthia    5.5  Reprovado
3   Helena    9.0   Aprovado

In [34]:
data_frame1.loc[data_frame1['Status'] == 'Reprovado'] # Retornando dados de um data frame com condição.

      nome  Media     Status
0  Marcelo    4.0  Reprovado
2  Cynthia    5.5  Reprovado

In [35]:
  data_frame1.loc[data_frame1['Status'] == 'Aprovado'] # Retornando dados de um data frame com condição.

     nome  Media    Status
1   Lucas    7.0  Aprovado
3  Helena    9.0  Aprovado

In [36]:
data_frame1.loc[data_frame1['Media'] < 6.0] # Retornando dados de um data frame com condição.

      nome  Media     Status
0  Marcelo    4.0  Reprovado
2  Cynthia    5.5  Reprovado

In [47]:
 # Construindo um novo dataframe a partir de condições específicas.
aprovado_exame = data_frame1[['nome', 'Media']].loc[data_frame1['Media'] >= 7.0]

In [48]:
aprovado_exame

     nome  Media
1   Lucas    7.0
3  Helena    9.0

In [50]:
 # Construindo um novo dataframe a partir de condições específicas.
reprovado_exame = data_frame1[['nome','Media','Status']].loc[data_frame1['Status'] == 'Reprovado']
reprovado_exame

      nome  Media     Status
0  Marcelo    4.0  Reprovado
2  Cynthia    5.5  Reprovado

In [61]:
# Usando uma função do pandas chamada Series para gerar um indice numérico em uma lista!
x = pd.Series([2,4,54,76,32,12,45,'café', 'manhã', 'bom dia'])
x

0          2
1          4
2         54
3         76
4         32
5         12
6         45
7       café
8      manhã
9    bom dia
dtype: object

In [53]:
import numpy as np # Importando a biblioteca numpy

In [62]:
# Criando um array numpy,  chamando um objeto numpay em uma função panda, Series e gerando indice numérico. 
array1 = np.array([2,3,4,5,66,'computador','televisão','youtube','facebook'])
array_series = pd.Series(array1)
array_series

0             2
1             3
2             4
3             5
4            66
5    computador
6     televisão
7       youtube
8      facebook
dtype: object

In [63]:
data_frame1

      nome  Media     Status
0  Marcelo    4.0  Reprovado
1    Lucas    7.0   Aprovado
2  Cynthia    5.5  Reprovado
3   Helena    9.0   Aprovado

In [68]:
y = data_frame1['nome'] # Manipulação de fatiamento de dataframes.  
obtemos séries:
print(y)
type(y)

0    Marcelo
1      Lucas
2    Cynthia
3     Helena
Name: nome, dtype: object

pandas.core.series.Series

In [71]:
y2 = data_frame1[['nome']] 
print(y2)
type(y)

      nome
0  Marcelo
1    Lucas
2  Cynthia
3   Helena

pandas.core.series.Series

In [72]:
# Alterando os nomes das colunas passada como parametro na função columns,  o dataframe.
data_frame1.rename(columns={"nome":"Nome","Media":"Média" })

      Nome  Média     Status
0  Marcelo    4.0  Reprovado
1    Lucas    7.0   Aprovado
2  Cynthia    5.5  Reprovado
3   Helena    9.0   Aprovado

In [74]:
# Retornando aos dados originais usando inplace. 
data_frame1.rename(columns={"Nome":"Nomes"},inplace=True)
data_frame1

      nome  Media     Status
0  Marcelo    4.0  Reprovado
1    Lucas    7.0   Aprovado
2  Cynthia    5.5  Reprovado
3   Helena    9.0   Aprovado

In [75]:
# Alterando o nome da coluna 'nome' para 'Nomes'.
data_frame1.rename(columns={"nome":"Nomes"})

     Nomes  Media     Status
0  Marcelo    4.0  Reprovado
1    Lucas    7.0   Aprovado
2  Cynthia    5.5  Reprovado
3   Helena    9.0   Aprovado

In [83]:
# Retornar quantos valores tem de cada campo de cada coluna.
data_frame1['Status'].value_counts()

Reprovado    2
Aprovado     2
Name: Status, dtype: int64

In [84]:
data_frame1

      nome  Media     Status
0  Marcelo    4.0  Reprovado
1    Lucas    7.0   Aprovado
2  Cynthia    5.5  Reprovado
3   Helena    9.0   Aprovado

In [85]:
# Excluindo uma coluna do dataframe, no exemplo excluindo a coluna Status
data_frame1.drop('Status', axis=1,inplace=True)

In [86]:
data_frame1

      nome  Media
0  Marcelo    4.0
1    Lucas    7.0
2  Cynthia    5.5
3   Helena    9.0

In [102]:
# Criando dicionário com dados faltantes. 
alunos2 = {'nome': ['Marcelo','Lucas','Cynthia','Helena', 'Sol',''], 'Media':[4,7,5.5,9,5,7],
          'Status':['Reprovado','Aprovado','Reprovado','Aprovado','Reprovado','Aprovado']}

In [100]:
alunos2

{'Media': [4, 7, 5.5, 9, 5, 7],
 'Status': ['Reprovado',
  'Aprovado',
  'Reprovado',
  'Aprovado',
  'Reprovado',
  'Aprovado'],
 'nome': ['Marcelo', 'Lucas', 'Cynthia', 'Helena', 'Sol']}

In [103]:
# Transformando dicionário em dataframe. 
data_frame2 = pd.DataFrame(alunos2) 
data_frame2

      nome  Media     Status
0  Marcelo    4.0  Reprovado
1    Lucas    7.0   Aprovado
2  Cynthia    5.5  Reprovado
3   Helena    9.0   Aprovado
4      Sol    5.0  Reprovado
5             7.0   Aprovado

In [98]:
# Excluindo linha no dataframe com campo nulo. Dúvida.
teste = data_frame2.dropna()
teste

      nome  Media     Status
0  Marcelo    4.0  Reprovado
1    Lucas    7.0   Aprovado
2  Cynthia    5.5  Reprovado
3   Helena    9.0   Aprovado
4      Sol    5.0  Reprovado
5             7.0   Aprovado

In [96]:
# retornar valor boleano para informar campos nulo no dataframe. 
nulos = data_frame2.isnull()

In [97]:
nulos

    nome  Media  Status
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False

In [105]:
# Verificando a quantidade de dados nulos e somando, e retornando o resuldado. 
quantidade_nulos = data_frame2.isnull().sum()
quantidade_nulos

nome      0
Media     0
Status    0
dtype: int64

In [106]:
# Verificando o percentual de linhas a ser verificada  de uma coluna
len(data_frame2['Media'])

6

In [108]:
# Prencher dados faltantes. 
#data_frame2['Media'].fillna('sem dados', inplace = True)
#data_frame2

      nome  Media     Status
0  Marcelo    4.0  Reprovado
1    Lucas    7.0   Aprovado
2  Cynthia    5.5  Reprovado
3   Helena    9.0   Aprovado
4      Sol    5.0  Reprovado
5             7.0   Aprovado